Repository: mozilla-l10n/mt-training-data
Catalog: su/su_pontoon.tmx
Source language: en_us
Languages: su

source: Expand the page actions menu in the address bar any time you want to take a screenshot.
su: Legaan menu peta kaca dina palang alamat iraha baé anjeun rék néwak layar.

source: Expired (and deleted)
su: Kadaluwarsa (jeung dihapus)

source: Expired (but recoverable)
su: Kadaluwarsa (tapi bisa diala deui)

source: expired <timediff></timediff>
su: kadaluwarsa <timediff></timediff>

source: expires <timediff></timediff>
su: kadaluwarsa <timediff></timediff>

source: FAQs
su: LD

source: Favorite this shot
su: Paporitkeun ieu téwakan

source: Firefox Screenshots automatically changes to Download-Only mode in these situations:
su: Firefox Screenshots otomatis robah ka mode Ukur-Ngundeur dina situasi ieu:

source: Firefox Screenshots Metrics
su: Métrik Firefox Screenshots

source: Firefox Screenshots Settings
su: Setélan Firefox Screenshots

source: Free Download
su: Undeur Haratis

source: Generated at: { $created }
su: Dipangnyieunkeun dina: { $created }

source: Get a shareable link to this shot:
su: Jieun tutumbu bagikeuneun pikeun ieu téwakan:

source: Get Started
su: Mitembeyan

source: Give Feedback
su: Béré Pangdeudeul

source: Give them a try
su: Cobaan

source: Go on, create some.
su: Sok atuh, jieun.

source: Go To My Shots
su: Miang ka Téwakan Kami

source: Green
su: Héjo

source: Grey
su: Hawuk

source: { gScreenshotsDescription } <a>Get Firefox now</a>
su: { gScreenshotsDescription } <a>Cokot Firefox ayeuna</a>

source: Guest Account
su: Akun Tamu

source: Hello
su: Euy

source: Here is the page it was originally created from:
su: Ti dieu asal dijieunna ieu kaca:

source: Highlighter
su: Panyorot

source: How Firefox Screenshots Works
su: Cara Gawé Firefox Screenshots

source: How long should this shot be retained?
su: Sabaraha lila ieu téwakan rék diteundeun?

source: If you do nothing, this shot will be permanently deleted <timediff></timediff>.
su: Lamun diantep, ieu téwakan bakal dipupus permanén <timediff></timediff>.

source: If your Shots are subject to multiple claims, we may revoke your access to Firefox Screenshots.
su: Lamun Téwakan anjeun nepi ka diklaim sababaraha kali, aksés ka Firefox Screenshots bisa ditutup.

source: If you sign out, you will need to sign in again to regain access to your screenshots.
su: Lamun kaluar, anjeun kudu asup deui pikeun bisa muka deui téwakan layar.

source: If you took this shot and cannot delete it, you may need to temporarily enable third party cookies from your browser’s preferences.
su: Lamun teu bisa dihapus, sigana kudu ngahurungkeun kuki pihak katilu pikeun samentawis dina préferénsi panyungsi.

source: in a few seconds
su: sababaraha detik kaliwat

source: In a Private Browsing window.
su: Dina jandéla Langlangan Nyamuni.

source: Indefinitely ∞
su: Salilana ∞

source: in { $number } days
su: dina { $number } poé

source: in { $number } hours
su: dina { $number } jam

source: in { $number } minutes
su: dina { $number } menit

source: Intuitive screenshots baked right into the browser. Capture, save and share screenshots as you browse the Web using Firefox.
su: Potret layar intuitif dipanggang katuhu kana panyungsi dina. Capture, simpen na bagikeun Potret layar anjeun ngotéktak wéb nganggo pangotéktak Firefox.

source: Large
su: Badag

source: Length of time users have been creating shots, grouped by week
su: Lilana pamaké nyieun téwakan, dumasar minggu

source: Link Copied
su: Tutumbu Ditiron

source: Looking for your shots…
su: Nyaliksik téwakan anjeun...

source: Medium
su: Sedeng

source: Metrics
su: Métrik

source: My Shots
su: Téwakan Kami

source: My Shots: search for { $searchTerm }
su: Téwakan Kami: sungsi { $searchTerm }

source: “Never remember history” is enabled.
su: “Ulah inget jujutan” diaktipkeun.

source: Next page
su: Kaca satuluyna

source: Next Slide
su: Layar Saterusna

source: No saved shots.
su: Taya teundeunan téwakan.

source: No shots found
su: Taya téwakan kapanggih

source: Now, sign in to Screenshots with a Firefox Account and do more:
su: Ayeuna, asup ka Screenshots maké Firefox Account laju lampah leuwih loba:

source: { $number } days ago
su: { $number } poé kaliwat

source: { $number } hours ago
su: { $number } jam kaliwat

source: { $number } minutes ago
su: { $number } menit kaliwat

source: Number of days from a userʼs first shot to most recent shot, grouped by starting week
su: Jumlah poé ti téwakan munggaran nepi ka anu pang anyarna, dukumpulkeun mingguan

source: Number of shots
su: Jumlah téwakan

source: Number of shots created each day (for the last 30 days)
su: Jumlah téwakan dijieun unggal poé (30 poé panungtung)

source: Number of Shots per User
su: Jumlah Téwakan unggal Pamaké

source: Number of users
su: Jumlah pamaké

source: Number of users logging in
su: Jumlah pamaké nu asup log

source: Number of users who created at least one shot, by day (last 30 days)
su: Jumlah pamaké anu nyieun sahanteuna hiji téwakan, dumasar poé (30 poé panungtung)

source: Oops.
su: Beu.

source: Out of order.
su: Béakeun.

source: page
su: kaca

source: Page not found.
su: Kaca teu kapanggih.

source: Page Not Found
su: Kaca Teu Kapanggih

source: Pen
su: Péna

source: Please check your Internet connection. If you are able to connect to the Internet, there may be a temporary problem with the Firefox Screenshots service.
su: Pariksa sambungan Internétna. Lamun nyambung, sigana aya masalah témporér dina layanan Firefox Screenshotsna.

source: Please email { $dmca } to request further information.
su: Mangga kirim surél { $dmca } pikeun émbaran leuwih teleb.

source: Please include the URL of this shot in your email: { $url }
su: Tuliskeun ogé URL téwakanana dina surél anjeun: { $url }

source: Previous page
su: Kaca saméméhna

source: Previous Slide
su: Layar Saméméhna

source: Proceed
su: Teruskeun

source: Purple
su: Bungur

source: Red
su: Beureum

source: Redo
su: Pigawé deui

source: Remove All Data
su: Piceun Sakabéh Data

source: Report IP Infringement
su: Laporkeun pelanggaran IP

source: Report Shot
su: Laporkeun Téwakan

source: restore until { $date }
su: teundeun nepi ka { $date }

source: Retention by Week
su: Reténsi Minggon

source: save
su: teundeun

source: Save and Share
su: Teundeun jeung Bagikeun

source: Saved image will be cropped to {pixels}px in height.
su: Gambar anu diteundeun bakal dipotong nepi ka jangkungna jadi {pixels}px.

source: Save full page
su: Teundeun kaca lengkep

source: Save visible
su: Teundeun nu katempo

source: Saving your shot…
su: Neundeun téwakan anjeun...

source: Screenshot: { $originalTitle }
su: Téwakan layar: { $originalTitle }

source: Screenshots Home
su: Tepas Screenshots

source: Screenshots is changing
su: Screenshots robah

source: Screenshots is disabled in Private Browsing Mode
su: Téwakan layar ditumpurkeun Mode Langlangan Nyamuni

source: Screenshots made simple. Capture and download screenshots without leaving Firefox.
su: Screenshots jadi gampang. Téwak jeung unduh téwakan layar tanpa ninggalkeun Firefox.

source: Screenshots made simple. Take, save, and share screenshots without leaving Firefox.
su: Screenshots jadi gampang. Cokot, teundeun, jeung bagikeun téwakan layar tanpa ninggalkeun Firefox.

source: Sea Green
su: Héjo Laut

source: Search my shots
su: Paluruh téwakan kami

source: Select the buttons in the upper right to capture the visible area in the window or to capture an entire page.
su: Pilih tombol di luhur katuhu pikeun néwak anu katémbong dina layar atawa sakur eusi kaca.

source: Select the Screenshots icon from the page actions menu in the address bar, and the Screenshots menu will appear on top of your browser window.
su: Pilih ikon Screenshots ti menu peta kaca dina palang alamat, menu Screenshots bakal némbongan dina punclut jandéla panyungsi anjeun.

source: Select time
su: Pilih mangsa

source: Share link via email
su: Bagikeun tutumbu kana surél

source: Share on Facebook
su: Bagikeun di Facebook

source: Share on Pinterest
su: Bagikeun di Pinterest

source: Share on Twitter
su: Bagikeun di Twitter

source: Shot Copied
su: Téwakan Ditiron

source: Shots by Day
su: Téwakan dumasar Poé

source: Shot taken on another device
su: Téwakan anu dicokot tina séjén alat

source: Sign in to Screenshots with your Firefox Account to access your shots everywhere you use Firefox. An added bonus: you can also save your favorite shots forever.
su: Asup ka Screenshots maké Akun Firefox pikeun muka téwakan anjeun di mana waé maké Firefox. Bonus émbohna: anjeun ogé bisa neundeun téwakan kameumeut salilana.

source: Sign in with your Firefox Account to access your shots on all of your devices and save your favorite shots forever.
su: Asup maké Akun Firefox pikeun muka téwakan ti sakur parangkat anjeun sarta neundeun téwakan petingan anjeun salilana.

source: SKIP
su: LIWAT

source: Small
su: Leutik

source: Something went wrong
su: Aya nu salah

source: Sorry for the inconvenience. We are working on this feature for future releases.
su: Hampura. Fitur ieu keur dihanca pikeun rilis jaga.

source: Sorry! We couldn’t save your shot. Please try again later.
su: Hampura! Téwakan teu bisa diteundeun. Cobaan deui engké.

source: Starting in June, Screenshots will no longer offer online storage. Want to keep shots from your library? Download shots individually or <a>in batch</a>. Thank you for using this feature, and we’re sorry for any inconvenience.
su: Mimiti Juni, Screenshots moal nawaran deui gudang daring. Rék nyimpen téwakan tina pabukon anjeun? Unduh hiji-hiji atawa <a>disabuntelkeun</a>. Nuhun geus maké ieu fitur, hampura bisi matak riweuh.

source: Store your favorite shots forever
su: Teundeun téwakan layar kameumeut anjeun salilana

source: Take a Screenshot
su: Cokot Téwakan Layar

source: Take clips and screenshots from the Web and save them temporarily or permanently.
su: Cokot klip jeung téwakan layar ti Raramat turta teundeun saheulaanan atawa salilana.

source: Take, copy, and download screenshots without leaving Firefox.
su: Téwak, tiron, sarta undeur téwakan layar tanpa ninggalkeun FIrefox.

source: Take Note!
su: Catet!

source: Take your best shot. Screenshots lets you download your selection or copy it right to your clipboard.
su: Téwak sing hadé. Hasil Screenshots bisa diunduh sapamilih atawa ditiron langsung kana papan klip.

source: Take your best shot. Then save it to the online Screenshots library, and Firefox copies the link to your clipboard for easy sharing. Shots in the library automatically expire after two weeks, but you can delete them at any time or choose to keep them longer.
su: Téwak sahadéna. Teundeun di pabukon Screenshots onlén, laju ku Firefox ditiron tutumbuna kana papan klip ngarah gampang babagi. Téwakan dina pabukon bakal kadaluwarsa sanggeus dua minggu, tapi bisa dihapus iraha waé atawa diteundeun leuwih lila.

source: Terms
su: Katangtuan

source: Text size
su: Ukuran téks

source: The link to your shot has been copied to the clipboard. Press {meta_key}-V to paste.
su: Tutumbu ka téwakan anjeun geus ditiron kana papan klip. Pencét {meta_key}-V pikeun napelkeun.

source: The number of users who have about N total shots
su: Jumlah pamaké anu boga N téwakan

source: The version of the add-on used during login, in the last 14 days
su: Vérsi pangeuyeub anu dipaké salila login, 14 poé panungtung

source: Third-party cookies are disabled.
su: Kuki pihak katilu ditumpurkeun.

source: This is a favorite shot and it does not expire
su: Ieu téwakan petingan sarta moal kadaluwarsa

source: This is not a favorite shot and it will expire
su: Ieu lain téwakan petingan sarta bakal kadaluwarsa

source: This isn’t a standard Web page, so you can’t take a screenshot of it.
su: Ieu lain kaca Raramat biasa, ku kituna anjeun teu bisa néwak layarna.

source: This shot has expired.
su: Ieu téwakan geus kadaluwarsa.

source: This shot is no longer available due to a third party intellectual property claim.
su: Ieu téwakan geus teu bisa dibuka alatan ayana klaim kekayaan inteléktual pihak katilu.

source: This will permanently erase all of your Firefox Screenshots data.
su: Ieu bakal ngahapus permanén sakur data Firefox Screenshots Anjeun.

source: To export: use File > Save Page As… and you will find your screenshots in the folder { $folder }
su: Pikeun ékspor: paké File > Save Page As… anjeun bakal manggihan téwakan layar anjeun dina folder { $folder }

source: Total devices registered
su: Jumlah paranti kadaptar

source: Total Retention
su: Jumlah Reténsi

source: Totals
su: Jumlah

source: Unable to copy your shot to the clipboard.
su: Teu bisa niron téwakan anjeun kana papan klip.

source: Updated editing tools let you crop, highlight, and even add text to your shot.
su: Parabot pangropéa nu anyar bisa ngeureut, nyirian, turta nambahkeun téks kana téwakan anjeun.

source: Uploads have been disabled.
su: Unjalan geus ditumpurkeun.

source: Users by Day
su: Pamaké dumasar Poé

source: Use the buttons in the upper right to capture full pages. The Save Visible button will capture the area you can view without scrolling, and Save Full Page will capture everything on the page.
su: Paké tombol di luhur lebah katuhu pikeun néwak sakabéh kaca. Tombol Teundeun Sakatempo bakal néwak eusi kaca anu harita katempo, anapon Teundeun Kaca Lengkep bakal néwak sakur anu aya dina éta kaca.

source: We can’t connect to your screenshots.
su: Teu bisa nyambung ka téwakan layar anjeun.

source: We canʼt find any shots that match your search.
su: Taya téwakan anu cocog jeung pamaluruhan anjeun.

source: We can’t screenshot this page.
su: Ieu kaca teu bisa ditéwak layarna.

source: We couldn’t save your shot because there is a problem with the Firefox Screenshots service. Please try again later.
su: Téwakan teu bisa diteundeun alatan aya masalah dina layanan Firefox Screenshots. Cobaan deui engké.

source: Week the user first created a shot
su: Minggu munggaran pamaké nyieun téwakan

source: We hope you’ll continue to use Screenshots to capture, copy, and download shots.
su: Mangga lajengkeun migunakeun Screenshots pikeun nyimpen, nyalin, jeung ngundeur tétéwakan.

source: We’re not sure what just happened. Care to try again or take a shot of a different page?
su: Teuing kunaon. Cobaan deui atawa coba téwak layar kaca lian?

source: What’s new with Firefox Screenshots?
su: Naon nu anyar ti Firefox Screenshots?

source: White
su: Bodas

source: Whoa! Firefox Screenshots went haywire.
su: Euleuh! Firefox Screenshotsna ngaco.

source: Yellow
su: Konéng

source: You are currently in Download-Only mode.
su: Anjeun ayeuna keur dina modeu Ukur-Undeur.

source: You are using Firefox ESR.
su: Anjeun maké Firefox ESR.

source: You can sign in to access your screenshots across devices.
su: Anjeun bisa asup pikeun muka téwakan layar meuntas gawai.

source: You can’t take a shot of a Firefox Screenshots page!
su: Anjeun teu bisa néwak kaca Firefox Screenshots!

source: You must have Firefox Screenshots installed or signed in to Firefox Account to delete your account
su: Anjeun kudu masang Firefox Screenshots atawa asup ka Akun Firefox pikeun ngahapus akun

source: Your selection is too small
su: Pilihan anjeun leutik teuing

source: Your shot has been copied to the clipboard. Press {meta_key}-V to paste.
su: Téwakan anjeun geus ditiron kana papan klip. Pencét {meta_key}-V pikeun napelkeun.

source: Your Shots Everywhere
su: Téwakan Anjeun di Mamana

source: %1$s finished
su: %1$s anggeus

source: %1$s is free and open source software made by Mozilla and other contributors.
su: %1$s téh aplikasi bébas sarta sumber nembrak nu dijieun ku Mozilla jeung kontributor séjénna.

source: %1$s is made available to you under the terms of the <a href="%2$s">Mozilla Public License</a> and other open source licenses.
su: %1$s dijieunna pikeun anjeun kalayan dina pasaratan <a href="%2$s">Lisénsi Umum Mozilla</a> jeung lisénsi sumber nembrak nu séjén.

source: %1$s is ready to block ads
su: %1$s geus siap meungpeuk iklan

source: %1$s will send what you type in the address bar to your search engine
su: %1$s bakal ngirim naon anu diketikkeun dina bilah alamat kana mesin pamaluruh anjeun

source: About %1$s, help
su: Ngeunaan %1$s, pitulung

source: Ad blocking
su: Meungpeuk iklan

source: Ad Blocking
su: Peungpeuk Iklan

source: Add and manage custom autocomplete URLs.
su: Tambah jeung atur URL otokumplit sakahayang.

source: + Add another search engine
su: + Tambah mesin pamaluruh séjén

source: + Add custom URL
su: + Tambah URL sakahayang

source: Add custom URL
su: Tambah URL sakahayang

source: Add link to autocomplete
su: Tambahkeun tutumbu kana autokumplit

source: Add shortcuts to your home screen
su: Tambah takulan ka layar tepas

source: An installed search engine is already using that name.
su: Mesin pamaluruh nu kapasang geus aya kalawan ngaran nu sarupa.

source: As a private browser, we never save and cannot restore this tab.
su: Salaku panyungsi nyamuni, tab teu kungsi disimpen sarta teu bisa dibuka ulang.

source: As a private browser, we never save and cannot restore your last browsing session.
su: Salaku panyungsi nyamuni, rintakan langlangan panungtung teu disimpen jeung teu bisa dimuat ulang.

source: Autocomplete
su: Otokumplit

source: Autocomplete URLs for sites you use most Long-press any URL in the address bar
su: Otokumplit URLs pikeun loka anu mindeng dianjangan Pencét lila URL dina bilah alamat

source: Automatic private browsing. Browse. Erase. Repeat.
su: Langlangan nyamuni otomatis. Langlang. Pupus. Deui.

source: Block 3rd-party cookies only
su: Peungpeuk kuki pihak katilu hungkul

source: Block 3rd-party tracker cookies only
su: Peungpeuk kuki palacak pihak ka-3 hungkul

source: Block ads and other annoyances
su: Peungpeuk iklan jeung rereged lianna

source: Block ad trackers
su: Peungpeuk palacak iklan

source: Block all cookies (will cause websites to break)
su: Peungpeuk kabéh kuki (bisa ngabalukarkeun loka jadi beulah)

source: Block all third-party cookies (may cause websites to break)
su: Peungpeuk sakur kuki pihak katilu (bisa ngabalukarkeun loka jadi beulah)

source: Block analytic trackers
su: Peungpeuk palacak analitik

source: Block content like ads and code that follow you around the web and slow you down. Turn on ad blocking to browse faster without annoying ads.
su: Peungpeuk kontén sarupaning iklan jeung sandi anu nunuturkeun anjeun ngalanglang raramat sarta matak laun. Hurungkeun peungpeuk iklan ngarah ngalanglang jadi leuwih gancang tanpa kaganggu ku iklan.

source: Block cookies
su: Peungpeuk kuki

source: Block JavaScript
su: Peungpeuk JavaScript

source: Block other content trackers
su: Peungpeuk palacak kontén séjén

source: Block potentially dangerous and deceptive sites
su: Meungpeuk loka pibahyaeun jeung titipu

source: Block reported deceptive and attack sites, malware sites, and unwanted software sites.
su: Peungpeuk loka anu dilaporkeun titipu jeung virusan, loka malwér, sarta loka sopwér nu teu dipiharep.

source: Block social trackers
su: Peungpeuk palacak sosial

source: Blocks trackers that analyze and measure interactions like tapping and scrolling
su: Meungpeuk palacak anu nyaliksik jeung ngukur interaksi kawas tap jeung gorolong

source: Blocks tracking activity, but may cause some sites and pages to behave unexpectedly
su: Meungpeuk kagiatan ngalacak, tapi bisa ngabalukarkeun paripolah sababaraha loka jadi teu bener

source: Block third-party trackers cookies (recommended)
su: Peungpeuk kuki palacak pihak katilu (disarankeun)

source: Block Web fonts
su: Peungpeuk aksara Raramat

source: Browse faster by stopping ads and code that follows you around the web.
su: Ngalanglang leuwih gancang ku ngeureunan iklan jeung kode anu nunuturkeun anjeun ngalanglang raramat.

source: Content Blocking
su: Meungpeuk Kontén

source: Content Blocking is disabled
su: Meungpeuk kontén dipareuman

source: Content Blocking is enabled
su: Meungpeuk kontén dihurungkeun

source: Cookies and Site Data
su: Data Kuki jeung Loka

source: Custom URLs
su: URL Sakahayang

source: Data Choices
su: Pilihan Data

source: Data Collection & Use
su: Pangumpulan & Pamakéan Data

source: Default
su: Baku

source: Default browser, tabs, language
su: Panyungsi, tab, jeung basa baku

source: Default URL List
su: Daptar URL Baku

source: Double-check the URL you entered.
su: Pariksa deui URL anu diasupkeun.

source: Downloaded files <b>will not be deleted</b> when you erase %1$s history.
su: Koropak undeuran <b>moal dipupus</b> nalika anjeun mupus %1$s jujutan.

source: Download File
su: Undeur Koropak

source: Download Firefox
su: Undeur Firefox

source: Embedded on sites to track your visits and to display functionality like share buttons
su: Naplok dina loka pikeun ngalacak anjangan anjeun sarta pikeun némbongkeun fungsionalitas sarupaning tumbul babagi

source: Enable to autocomplete more than 450 popular URLs in the address bar.
su: Aktipkeun pikeun otomatis ngalengkepan leuwih ti 450 URL populér dina palang alamat.

source: Enable to autocomplete sites you add here.
su: Bisakeun otokumplit loka anu diasupkeun di dieu.

source: Enable to have %1$s autocomplete over 450 popular URLs in the address bar.
su: Hurungkeun hambéh %1$s otokumplit leuwih ti 450 URL kakoncara di leunjeuran alamat.

source: Enabling may cause some pages to behave unexpectedly
su: Ngahurungkeun bisa ngabalukarkeun sababaraha kaca jadi ngaco

source: Enter search string
su: Asupkeun string pamaluruhan

source: Erase
su: Pupus

source: Erase and Open
su: Pupus jeung Buka

source: Erase and open %1$s
su: Pupus jeung buka %1$s

source: Erase browsing history
su: Beresihan jujutan langlangan

source: Erase & open
su: Pupus & buka

source: Example: example.com
su: Conto: example.com

source: Example: example.com/search/?q=%s
su: Conto: conto.com/search/?q=%s

source: Example: mozilla.org
su: Conto: mozilla.org

source: Exit Private Browsing?
su: Tutup Langlangan Nyamuni?

source: Finger moved too fast. Try again.
su: Napelkeun ramona téréh teuing. Pecakan deui.

source: Fingerprint icon
su: Ikon sidik ramo

source: Fingerprint not recognized. Try again.
su: Sidik ramo teu dipikawanoh. Pecakan deui.

source: For Sites You Add
su: Pikeun Loka anu Anjeun Nambahkeun

source: For Top sites
su: Pikeun loka Petingan

source: Get one-tap access to sites you use most%1$s Menu > Add to Home screen
su: Hontal aksés sakali toél ka loka-loka anu pangmindengna dianjangan%1$s Menu > Tambahkeun ka layar Tepas

source: Get one-tap access to sites you use most Menu > Add to Home screen
su: Hontal aksés sakali toél ka loka-loka anu pangmindengna dianjangan Menu > Tambahkeun ka layar Tepas

source: Get search suggestions
su: Cokot bongbolongan maluruh

source: Hide webpages when switching apps
su: Samunikeun kaca raramat nalika pindah aplikasi

source: Hide webpages when switching apps and block taking screenshots.
su: Sumputkeun kaca raramat nalika mindahkeun app sarta meungpeuk nyokot téwakan layar.

source: Installed search engines
su: Mesin pamaluruh nu dipasang

source: Make %1$s default browser
su: Jadikeun %1$s panyungsi baku

source: Make privacy a habit
su: Matuhkeun salindungan

source: Manage sites
su: Kokolakeun loka

source: May result in missing icons or images
su: Matak leungit ikon atawa gambar

source: More options button
su: Tombol pilihan lianna

source: Mozilla strives to collect only what we need to provide and improve %1$s for everyone.
su: Mozilla bakal kukumpul data nu diperlukeun hungkul jang nyadiakeun jeung ngoméan %1$s pikeun balaréa.

source: New custom URL added.
su: URL sakahayang anyar geus ditambahkeun.

source: New feature! Browse faster by stopping ads and code that follow you around the web.
su: Fitur anyar! Ngalanglang leuwih gancang ku ngeureunan iklan jeung kode anu nunuturkeun anjeun ngalanglang raramat.

source: New search engine added.
su: Mesin pamaluruh anyar ditambahkeun.
